Repository: Nvdtn19/Sen.Environment
Catalog: Modding/lib/l10n/app_*.arb
Languages: ru

# author_of_this_locale
source: Haruma
ru: Vi

# ru
source: Russian
ru: Русский

# en
source: English
ru: Английский

# vi
source: Vietnamese
ru: Вьетнамский

# es
source: Spanish
ru: Испанский

source: Not specified
ru: Не указано

source: Default setting
ru: По умолчанию

source: Theme
ru: Тема

source: Language
ru: Язык

# author
source: Translator
ru: Перевод выполнен

source: Application Setting
ru: Настройки приложения

source: Send notification
ru: Уведомления

source: Storage permission
ru: Память

source: Granted
ru: Разрешение выдано

source: Denied
ru: Разрешение не выдано

source: Toolchain
ru: Папка приложения

source: Upload directory
ru: Выбрать папку

source: Enable
ru: Включить

source: Disable
ru: Отключить

source: Okay
ru: ОК

source: System
ru: Системная

source: Light
ru: Светлая

source: Dark
ru: Тёмная

# js_page
source: JS Category
ru: Категория JS

source: Home
ru: Главная

source: Settings
ru: Настройки

# shell_description
source: Use the Shell to process files
ru: Shell используется для обработки и изменения файлов

source: Method Picker
ru: Выбор метода

# method_picker_description
source: Select method to use from categories of methods
ru: Выберите нужный вам метод из категорий методов

source: JS Execute
ru: Выполнение скриптов JS

# js_execute_description
source: Run built-in JS
ru: Выполните один из встроенных скриптов JS

source: Animation Viewer
ru: Просмотр анимаций

# animation_viewer_description
source: Through Animation Viewer, view actual animation that will be performed
ru: Здесь вы можете посмотреть анимации выбрав нужный файл

source: Toolchain is invalid
ru: Неверно указана папка приложения

source: User Provided
ru: Предоставлено пользователем

source: Execute again?
ru: Повторить выполнение?

source: yes
ru: Да

source: no
ru: Нет

source: Elapsed time
ru: Время выполнения

source: Upload file
ru: Выбрать файл

source: Recent files
ru: Недавние файлы

source: Cancel
ru: Отмена

source: Invalid Request
ru: Неверный запрос

# shell_request_behavior
source: Shell cannot be closed until finished
ru: Shell не может быть закрыт во время выполнения операции

source: Android Request
ru: Запрос от Android

# android_storage_access_permission_required
source: Android Storage Permission are required to read/write files
ru: Для чтения и записи файлов приложению необходимо разрешение на управление памятью устройства

source: Go to Settings
ru: Перейти к настройкам

# shell_has_finished
source: Shell has finished the job, back to application now!
ru: Shell завершил выполнение операции, возвращаемся к приложению!

source: Use
ru: Использовать

source: Select option
ru: Выберите опцию

source: Submit
ru: Подтвердить

source: Label
ru: Анимация

source: Media
ru: Медиа

source: Sprite
ru: Спрайт

source: Image
ru: Изображение

source: Upload media
ru: Выбрать медиа

source: Drop file to upload
ru: Перетащите файл для его загрузки

source: Upload file to continue...
ru: Выберите файл для продолжения...
